<a href="https://colab.research.google.com/github/danilo-91/practico-diplo-ayvd/blob/master/00_generacion_dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import io
import pandas
import scipy
import seaborn

print(seaborn.__version__)

0.10.1

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

Quizá sería bueno tener un bloque de código con las importaciones que se hacen.

In [1]:
reqs = ['io', 'pandas', 
        'scipy', 'seaborn']
reqs

['io', 'pandas', 'scipy', 'seaborn']

En los requisitos tenemos a Pandas, una de las librerías más importantes para hacer ciencia de datos en Python. Tenemos a Seaborn, que es una librería para hacer gráficos. Figura en la lista de Awesome, así que debería ser muy buena. Scipy es otra de las librerías core del stack de SciPy. Sirve para hacer muchas rutinas matemátias y estadísticas importantes. Por último, io es una de las librerías básicas de Python, que le permite manejar varios tipos de inputs y outputs, para leer y escribir de forma persistente.

Para comenzar, en el archivo headers.csv tenemos el dataset con sólo una respuesta, que usamos como base para rellenar nuestro formulario

In [7]:
#df = pandas.read_csv('./datos/headers.csv')
df = pandas.read_csv('http://samplecsvs.s3.amazonaws.com/SalesJan2009.csv')

In [8]:
df

    Transaction_date   Product Price  ...    Last_Login   Latitude   Longitude
0        1/2/09 6:17  Product1  1200  ...   1/2/09 6:08  51.500000   -1.116667
1        1/2/09 4:53  Product1  1200  ...   1/2/09 7:49  39.195000  -94.681940
2       1/2/09 13:08  Product1  1200  ...  1/3/09 12:32  46.188060 -123.830000
3       1/3/09 14:44  Product1  1200  ...  1/3/09 14:22 -36.133333  144.750000
4       1/4/09 12:56  Product2  3600  ...  1/4/09 12:45  33.520560  -86.802500
..               ...       ...   ...  ...           ...        ...         ...
993    1/22/09 14:25  Product1  1200  ...   3/1/09 3:37  54.583333   -5.933333
994     1/28/09 5:36  Product2  3600  ...   3/1/09 4:40 -20.360278   57.366111
995      1/1/09 4:24  Product3  7500  ...   3/1/09 7:21  42.946940  -76.429440
996     1/8/09 11:55  Product1  1200  ...   3/1/09 7:28  52.083333    0.433333
997    1/12/09 21:30  Product1  1200  ...  3/1/09 10:14  43.073060  -89.401110

[998 rows x 12 columns]

## Agregando valores


Para trabajar más cómodamente, renombraremos las columnas de DataFrame. Tengan cuidado de que el orden de los nombres nuevos se corresponda con el contenido de cada columna.

El atributo para modificar los títulos de las columnas es '.columns'. Le paso una lista y va ubicado desde la primera a la última. En este caso yo cambié el CSV, así que voy a cambiar los nombres también.

In [10]:
df.columns = ['timestamp', 'product', 'price', 'payment_type', 'name', 'city', 'state', 'country',
              'account_created', 'last_login', 'latitude', 'longitude']

In [11]:
df

         timestamp   product price  ...    last_login   latitude   longitude
0      1/2/09 6:17  Product1  1200  ...   1/2/09 6:08  51.500000   -1.116667
1      1/2/09 4:53  Product1  1200  ...   1/2/09 7:49  39.195000  -94.681940
2     1/2/09 13:08  Product1  1200  ...  1/3/09 12:32  46.188060 -123.830000
3     1/3/09 14:44  Product1  1200  ...  1/3/09 14:22 -36.133333  144.750000
4     1/4/09 12:56  Product2  3600  ...  1/4/09 12:45  33.520560  -86.802500
..             ...       ...   ...  ...           ...        ...         ...
993  1/22/09 14:25  Product1  1200  ...   3/1/09 3:37  54.583333   -5.933333
994   1/28/09 5:36  Product2  3600  ...   3/1/09 4:40 -20.360278   57.366111
995    1/1/09 4:24  Product3  7500  ...   3/1/09 7:21  42.946940  -76.429440
996   1/8/09 11:55  Product1  1200  ...   3/1/09 7:28  52.083333    0.433333
997  1/12/09 21:30  Product1  1200  ...  3/1/09 10:14  43.073060  -89.401110

[998 rows x 12 columns]

## Distintas distribuciones para distintos datos

In [ ]:
import numpy 

N = 100

new_data = {}
new_data['gender'] = numpy.random.choice(
    ['Mujer', 'Varon', 'Otro', 'Prefiero no decirlo'], size=N,
    p=[0.3, 0.65, 0.01, 0.04])
new_data['age'] = numpy.random.normal(35, 15, size=N).astype(numpy.int32)
new_data['zodiac_sign'] = numpy.random.choice(
    ['Aries', 'Tauro', 'Géminis', 'Cáncer', 'Leo', 'Virgo', 'Libra', 'Escorpio',
     'Sagitario', 'Capricornio', 'Acuario', 'Picis'], size=N)
new_data['profession'] = numpy.random.choice(
    ['Programador', 'Profesor', 'Maestra', 'Profesora', 'Contador', 'Contadora',
     'Ingeniero', 'Economista', 'Estudiante', 'Matemático', 'Matemático',
     'Físico', 'Física'], size=N)
round_100 = lambda x: int(int(x) / 100) * 1000
new_data['junior_programmer_salary'] = numpy.vectorize(round_100)(
    numpy.random.lognormal(mean=8.15, sigma=0.25, size=N))
new_data['senior_programmer_salary'] = numpy.vectorize(round_100)(
    numpy.random.lognormal(mean=9, sigma=0.35, size=N))
new_df = pandas.DataFrame(new_data)
new_df

                 gender  ...  senior_programmer_salary
0   Prefiero no decirlo  ...                    149000
1                 Mujer  ...                     74000
2                 Varon  ...                     75000
3                 Varon  ...                    127000
4                 Varon  ...                     84000
..                  ...  ...                       ...
95                Varon  ...                     68000
96                Varon  ...                     52000
97                Varon  ...                     48000
98                Varon  ...                     76000
99                Mujer  ...                    121000

[100 rows x 6 columns]

# Save dataset

In [13]:
from google.colab import files
df.to_csv('generated_dataset.csv') 
files.download('generated_dataset.csv')

Está bueno tener a mano este bloque de código para generar y guardar un CSV en Colab.